Repository: 84000/data-translation-memory
Catalog: toh238-v3.tmx
Source language: bo
Languages: en

source: རིགས་ཀྱི་བུ་རྨི་ལམ་དང་། སྒྱུ་མ་དང་། དྲི་ཟའི་གྲོང་ཁྱེར་དང་། སྨིག་རྒྱུ་དང་། མགལ་མེ་བསྐོར་བ་དང་། སྐྲ་ཤད་འཛིངས་པ་དང་། སྤྲུལ་པ་དང་། བྲག་ཅ་དང་། གཟུགས་བརྙན་ལྟ་བུར་ཐམས་ཅད་བལྟ་བར་བྱའོ། །བྱང་ཆུབ་སེམས་དཔའ་རྩོམ་པ་མེད་ཀྱིས་གསོལ་པ།
en: “Child of good family,” replied the Blessed One, “everything should be regarded as a dream, an illusion, a city of gandharvas, a mirage, the circling of a firebrand, falling hair, a magical creation, an echo, or a reflection.”

source: བཅོམ་ལྡན་འདས་གང་རྨི་ལམ་དང་། སྒྱུ་མ་དང་། དྲི་ཟའི་གྲོང་ཁྱེར་དང་། སྨིག་རྒྱུ་དང་། མགལ་མེ་བསྐོར་བ་དང་། སྐྲ་ཤད་འཛིངས་པ་དང་།
en: “Blessed One, what is ‘everything’ that should be regarded as a dream, an illusion, a city of gandharvas, a mirage, the circling of a firebrand, falling hair, a magical creation, an echo, or a reflection?”

source: སྤྲུལ་པ་དང་། བྲག་ཅ་དང་། གཟུགས་བརྙན་ལྟ་བུར་བལྟ་བ་ཐམས་ཅད་གང་ལགས།
en: asked the bodhisattva Nirārambha.

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་ཐམས་ཅད་ཅེས་བྱ་བ་ནི་མིག་དང་། གཟུགས་དང་། རྣ་བ་དང་སྒྲ་དང་། སྣ་དང་དྲི་དང་། ལྕེ་དང་རོ་དང་། ལུས་དང་རེག་བྱ་དང་། ཡིད་དང་ཆོས་རྣམས་ཏེ།
en: “Child of good family,” replied the Blessed One, “ ‘everything’ means the eye and form, the ear and sound, the nose and scent, the tongue and taste, the body and touch, and the mind and phenomena.

source: རིགས་ཀྱི་བུ་དེ་དག་ནི་གང་རྨི་ལམ་དང་། སྒྱུ་མ་དང་། དྲི་ཟའི་གྲོང་ཁྱེར་དང་། སྨིག་རྒྱུ་དང་། མགལ་མེ་བསྐོར་བ་དང་། སྐྲ་ཤད་འཛིངས་པ་ལྟ་བུ་དང་། སྤྲུལ་པ་དང་། བྲག་ཅ་དང་། གཟུགས་བརྙན་ལྟ་བུར་བལྟ་བར་བྱ་བའི་ཤེས་པ་ཐམས་ཅད་དོ། །
en: Child of good family, it is all these modes of knowledge that should be regarded as a dream, an illusion, a city of gandharvas, a mirage, the circling of a firebrand, falling hair, a magical creation, an echo, or a reflection.

source: དེ་ལ་འཛིན་པ་ནི་མིག་དང་། རྣ་བ་དང་སྣ་དང་། ལྕེ་དང་ལུས་དང་། ཡིད་རྣམས་སོ། །
en: The eye, ear, nose, tongue, body, and mind are the apprehending subjects.

source: གཟུང་བ་ནི་གཟུགས་དང་། སྒྲ་དང་། དྲི་དང་རོ་དང་། རེག་བྱ་དང་ཆོས་རྣམས་ཏེ།
en: Form, sound, scent, taste, texture, and phenomena are the apprehended objects.

source: གཟུང་བ་དང་འཛིན་པའི་ཆོས་འདི་དག་རྣམ་པ་དང་། ཚུལ་ཐམས་ཅད་ཀྱིས་ཤེས་པ་དང་། ཁོང་དུ་ཆུད་པ་དང་། སྟོན་ནུས་པ་དེ་ནི་ཐམས་ཅད་མཁྱེན་པ་ཞེས་བྱའོ། །
en: ‘Omniscience’ refers to the capacity to know these phenomena of the apprehended objects and apprehending subjects in all their aspects and modes, to understand them, and to reveal them.

source: ཐམས་ཅད་མཁྱེན་པ་གང་ཡིན་པ་དེ་ནི་བག་ལ་ཉལ་བ་མེད་པ་ཉོན་མོངས་པ་མེད་པ། ངར་འཛིན་པ་མེད་པ། ང་ཡིར་འཛིན་པ་མེད་པ། ནམ་མཁའ་དང་མཚུངས་པ། མི་འགྱུར་བ།
en: One who is omniscient lacks latent impressions, afflictive emotions, and grasping at ‘I’ and ‘mine.’

source: སེམས་ཅན་ཐམས་ཅད་ལ་སེམས་མཉམ་པ། སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པའི་སེམས་དང་ལྡན་པ། ཐམས་ཅད་དུ་དབེན་པའི་སེམས་དང་ལྡན་པ་ཐམས་ཅད་དུ་ལྷུན་གྱིས་གྲུབ་པ། ལྷུན་གྱིས་གྲུབ་པའི་ཆོས་ཅན་སེམས་ཅན་གྱི་སྙིང་པོ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་ལ་སྒྲིབ་པ་མེད་པའི་ཆོས་ཅན། སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ།
en: They are equivalent to space, unchanging, regard all beings equally, are intent on benefiting all beings, are always intent on solitude, act effortlessly in all circumstances, have an effortless character, are the best of beings, have a character that is unobstructed in serving all beings, possess great compassion, have an unshakeable character, and are completely perfect buddhas.”

source: མི་བསྐྱོད་པའི་ཆོས་ཅན། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཞེས་བྱའོ། །བྱང་ཆུབ་སེམས་དཔའ་རྩོམ་པ་མེད་ཀྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཆོས་ཉིད་འདི་ཁོང་དུ་ཆུད་པར་འཚལ་བས་ཇི་ལྟ་བུར་བགྱི།
en: “Blessed One, what should a bodhisattva do who seeks to understand this basic nature of the blessed buddhas?”

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཆོས་ཉིད་འདི་ཁོང་དུ་ཆུད་པར་འདོད་པས་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་ངན་དུ་བྱས་པ་དང་། མི་སྙན་པ་ཐམས་ཅད་བཟོད་པར་བྱ་བའི་ཕྱིར་སེམས་ས་དང་མཚུངས་པར་བྱའོ། །
en: “O child of good family,” replied the Blessed One, “bodhisattvas who wish to understand this basic nature of the blessed buddhas should make their minds equal to the earth in order to cultivate patience for the negative things done by all beings and all of their unpleasantness.

source: བདག་དང་སེམས་ཅན་གཞན་རྣམས་ཀྱི་རྟོག་པ་དང་། རྣམ་པར་རྟོག་པའི་ཉོན་མོངས་པའི་དྲི་མ་ཐམས་ཅད་བཀྲུ་བའི་ཕྱིར་སེམས་ཆུ་དང་མཚུངས་པར་བྱའོ། །
en: They should make their minds equal to water in order to wash away all the stains of concepts and the afflictive emotions related to the conceptual thoughts of other beings as well as their own.

source: ཤེས་རབ་ཀྱིས་བདག་དང་སེམས་ཅན་གཞན་རྣམས་ཀྱི་ལས་དང་། ཉོན་མོངས་པའི་རྩི་ཤིང་བསྲེག་པའི་ཕྱིར་སེམས་མེ་དང་མཚུངས་པར་བྱའོ། །
en: They should make their minds like fire in order to burn away, with their insight, the brambles of the karma and afflictive emotions of other beings as well as themselves.

source: ཆགས་པ་ཐམས་ཅད་དང་དབྲལ་བའི་ཕྱིར་སེམས་རླུང་དང་མཚུངས་པར་བྱའོ། །
en: They should make their minds like wind in order to free themselves of all kinds of attachment.

source: ཐམས་ཅད་དུ་སྒྲིབ་པ་མེད་པའི་ངོ་བོ་ཉིད་ཀྱིས་སེམས་ནམ་མཁའ་དང་མཚུངས་པར་བྱའོ། །
en: They should make their minds to be essentially like space insofar as, essentially, it is entirely free of obscurations.

source: ཐམས་ཅད་དུ་འཇིགས་པ་མེད་ཅིང་སྐྲག་པ་མེད་པས་བྱང་ཆུབ་སེམས་དཔས་སེང་གེ་དང་མཚུངས་པར་བྱའོ། །
en: “Bodhisattvas should make their minds equal to a lion because they are always fearless and unafraid.

source: ཤིན་ཏུ་དུལ་བའི་སེམས་ཀྱིས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཁུར་ཁྱེར་བའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔས་གླང་པོ་ཆེ་དང་མཚུངས་པར་བྱའོ། །
en: Bodhisattvas should make their minds equal to an elephant in order to carry the burdens of all beings with a mind that is highly disciplined.

source: དམ་པའི་ཆོས་ཀྱི་ཆར་འབེབས་པའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔས་སྤྲིན་ལྟ་བུར་བྱའོ། །
en: Bodhisattvas should be like a cloud in order to rain down the sublime Dharma.

source: སེམས་ཅན་ཐམས་ཅད་ལ་ཡེ་ཤེས་ཀྱིས་སྣང་བར་བྱེད་པའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔས་ཉི་མ་ལྟ་བུར་བྱའོ། །
en: Bodhisattvas should be like the sun in order to illuminate all beings with their wisdom.

source: ཐམས་ཅད་དུ་སེམས་ཅན་ཐམས་ཅད་ལ་རྟག་ཏུ་བདེ་བར་སྣང་བའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔས་ཟླ་བ་ལྟ་བུར་བྱའོ། །
en: Bodhisattvas should be like the moon in order to continuously shine blissfully on all beings everywhere.

source: ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱིས་རིན་པོ་ཆེའི་གླིང་ཆེན་པོར་ཕྱོགས་པའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔས་དེད་དཔོན་ལྟ་བུར་བྱའོ། །
en: Bodhisattvas should be like a merchant captain in order to use their omniscient wisdom to steer toward a great island of gems.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པའི་ནད་ཐམས་ཅད་གསོ་བའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔས་སྨན་པ་ལྟ་བུར་བྱའོ། །
en: Bodhisattvas should be like a doctor in order to cure all the illnesses of the afflictive emotions all beings have.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཆོས་ལ་ཐེ་ཚོམ་ཟ་བའི་ཟུག་རྔུ་འདོན་པའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔས་ཟུག་རྔུ་འབྱིན་པ་ལྟ་བུར་བྱའོ། །
en: Bodhisattvas should be like a surgeon in order to remove the splinter of doubt about the Dharma all beings have.

source: ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱི་ཕྱོགས་ལ་མཁས་པའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔས་གདོས་པ་འཛིན་པ་ལྟ་བུར་བྱའོ། །
en: Bodhisattvas should be like a ship captain in order to be skilled in steering toward omniscient wisdom.

source: འཁོར་བའི་རྒྱ་མཚོ་ལས་སེམས་ཅན་སྒྲོལ་བ་ལ་མཁས་པའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔས་གྲུ་ལྟ་བུར་བྱའོ། །
en: Bodhisattvas should be like a boat in order to be skilled in freeing beings from the ocean of saṃsāra.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་འཚོ་བར་གྱུར་པའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔས་སྟེགས་ལྟ་བུར་བྱའོ། །
en: Bodhisattvas should be like a bridge in order to support all beings.

source: སེམས་ཅན་ཐམས་ཅད་མཚུངས་པར་འཇུག་པའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔས་ལམ་པོ་ཆེ་ལྟ་བུར་བྱའོ། །
en: Bodhisattvas should be like a highway in order to be equally accessible to all beings.

source: བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རིན་པོ་ཆེ་ཐམས་ཅད་ཕུན་སུམ་ཚོགས་པའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔས་རིན་པོ་ཆེའི་གླིང་ལྟ་བུར་བྱའོ། །
en: Bodhisattvas should be like an island of gems in order to be a perfect abundance of all the precious factors of awakening.

source: ཡིད་བཞིན་གྱི་ནོར་བུ་རིན་པོ་ཆེ་འདྲ་བར་བསམ་པ་ཐམས་ཅད་ཡོངས་སུ་སྐོང་བའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔས་ཡིད་བཞིན་གྱི་ནོར་བུ་རིན་པོ་ཆེ་ལྟ་བུར་བྱའོ། །
en: Bodhisattvas should be like a precious wish-fulfilling jewel in order to fulfill all wishes like a precious wish-fulfilling jewel.

source: ལེགས་པར་བྱས་པའི་ལས་བྱེད་པའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔས་ཅང་ཤེས་སུ་བྱའོ། །
en: Bodhisattvas should be like a thoroughbred in order to perform masterful actions.

source: ཤེས་རབ་ཟབ་ཅིང་གཏིང་དཔག་དཀའ་བའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔས་རྒྱ་མཚོ་ལྟ་བུར་བྱའོ། །
en: Bodhisattvas should be like an ocean so that their insight is deep and difficult to fathom.

source: སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ལས་བསམ་པ་མི་གཡོ་བའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔས་རི་རབ་དང་མཚུངས་པར་བྱའོ། །
en: Bodhisattvas should be like the highest mountain so that their attention never strays from awakening to buddhahood.

source: ཀུན་ནས་མཛེས་པའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔས་དཔག་བསམ་གྱི་ཤིང་ལྟ་བུར་བྱའོ། །
en: Bodhisattvas should be like a wish-fulfilling tree to remain ever beautiful.

source: མཐོང་བར་དཀའ་བའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔས་འཛམ་བུའི་ཆུ་བོའི་གསེར་འདྲ་བར་བྱའོ། །
en: Bodhisattvas should be like gold from the Jambu River insofar as they are rare to find.

source: ཆོས་ལ་དབང་ཐོབ་པའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔས་བརྒྱ་བྱིན་ལྟ་བུར་བྱའོ། །
en: “Bodhisattvas should be like Indra in order to gain mastery over phenomena.

source: རབ་ཏུ་ཞི་བའི་སྤྱོད་ལམ་ཕུན་སུམ་ཚོགས་པའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔས་ཚངས་པ་ལྟ་བུར་བྱའོ། །
en: Bodhisattvas should be like Brahmā insofar as they have perfected the path of peaceful conduct.

source: དམ་པའི་ཆོས་ཡོངས་སུ་སྐྱོང་བའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔས་འཇིག་རྟེན་སྐྱོང་བ་ལྟ་བུར་བྱའོ། །
en: Bodhisattvas should be like the world guardians in order to protect the sublime Dharma.

source: དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་བསྟེན་པའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔས་འཁོར་ལོས་སྒྱུར་བ་ལྟ་བུར་བྱའོ། །
en: Bodhisattvas should be like a universal monarch in order to follow the path of the ten virtuous actions.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་གསང་བ་འཛིན་པའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔས་བློན་པོ་ཆེན་པོ་ལྟ་བུར་བྱའོ། །
en: Bodhisattvas should be like a prime minister insofar as they keep the secrets of the blessed buddhas.

source: དགེ་སྦྱོང་ལ་གནས་པའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔས་མངོན་པར་འབྱུང་བ་ལ་དགའ་བར་བྱའོ། །
en: “Bodhisattvas should take joy in renunciation in order to maintain their asceticism.

source: ལུས་དང་ངག་དང་སེམས་ཞི་བའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔས་དགེ་སྦྱོང་དུ་བྱའོ། །
en: Bodhisattvas should train in asceticism in order to pacify their body, speech, and mind.

source: བསམ་གཏན་དང་ཏིང་ངེ་འཛིན་དང་སྙོམས་པར་འཇུག་པ་དང་མངོན་པར་ཤེས་པ་དང་རིག་པ་དང་རྣམ་པར་གྲོལ་བ་ཕུན་སུམ་ཚོགས་པའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔས་དགོན་པ་པར་བྱའོ། །
en: Bodhisattvas should be like a forest dweller in order to reach perfection in meditative concentration, samādhi, meditative composure, the higher cognitions, knowledge, and liberation.

source: སྟོང་པ་ཉིད་རྟོགས་པ་ཁོང་དུ་ཆུད་པའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔས་བསམ་གཏན་པར་བྱའོ། །
en: Bodhisattvas should cultivate meditative concentration in order to assimilate the realization of emptiness.

source: མིའམ་ཅི་དང་ལྟོ་འཕྱེ་ཆེན་པོ་དང་རིག་སྔགས་འཆང་གྲུབ་པ་འདུལ་བ་ལ་མཁས་པའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔས་དབེན་པ་ལ་མངོན་པར་དགའ་བར་བྱའོ། །
en: Bodhisattvas should delight in solitude in order to tame kinnaras, mahoragas, vidyādharas, and siddhas.

source: རིག་པ་གསུམ་རྟོགས་པར་ཁོང་དུ་ཆུད་པའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔས་རིག་སྔགས་འཆང་དུ་བྱའོ། །
en: Bodhisattvas should be vidyādharas in order to assimilate their realization of the three knowledges.

source: མངོན་པར་ཤེས་པ་དྲུག་ཐོབ་པའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔས་མངོན་པར་ཤེས་པའི་ཡེ་ཤེས་སུ་བྱའོ། །
en: Bodhisattvas should cultivate the wisdom of higher cognition in order to obtain the six higher cognitions.

source: ཕུང་པོ་དང་ཁམས་དང་སྐྱེ་མཆེད་ལ་མཁས་པའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔས་མང་དུ་ཐོས་པར་བྱའོ། །
en: Bodhisattvas should study extensively in order to become experts in the aggregates, elements, and sense bases.

source: བསྟན་བཅོས་ཐམས་ཅད་ལ་མཁས་པའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔས་སློབ་དཔོན་དུ་བྱའོ། །
en: Bodhisattvas should become teachers in order to be experts in all scientific treatises.

source: ཟང་ཟིང་མེད་པར་ཆོས་སྟོན་པའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔས་ཆོས་སྨྲ་བར་བྱའོ། །
en: Bodhisattvas should be Dharma reciters in order to teach the Dharma free of materialistic concerns.

source: འདོད་ཆགས་དང་ཞེ་སྡང་དང་གཏི་མུག་བཏུལ་བའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔས་འདུལ་བ་འཛིན་པར་བྱའོ། །
en: Bodhisattvas should uphold the Vinaya in order to tame desire, anger, and dullness.

source: ཐམས་ཅད་དུ་རུང་བ་ལ་ཚོད་ཤེས་པའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔས་མ་མོ་འཛིན་པར་བྱའོ། །
en: Bodhisattvas should be upholders of enumerations in order to know the appropriate measure in all contexts.

source: ཚོལ་བ་ཐམས་ཅད་དང་བྲལ་བའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔས་དུལ་བར་བྱའོ། །
en: “Bodhisattvas should cultivate restraint in order to free themselves from all seeking.

source: འདོད་ཆགས་དང་བྲལ་བའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔས་མི་རྒོད་པར་བྱའོ། །
en: Bodhisattvas should not be flustered in order to be free of desire.

source: ཞེ་སྡང་དང་བྲལ་བའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔས་མ་ཁེངས་པར་བྱའོ། །
en: Bodhisattvas should not be arrogant in order to be free of anger.

source: གཏི་མུག་དང་བྲལ་བའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔས་མུ་ཅོར་མི་སྨྲ་བར་བྱའོ། །
en: ﻿Bodhisattvas should not be garrulous in order to be free of dullness.

source: ངག་བསྡམས་པའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔས་ཚིག་འཆོལ་བར་མི་སྨྲ་བར་བྱའོ། །
en: Bodhisattvas should not speak confusedly in order to restrain their speech.

source: ཐེག་པ་ཆེན་པོ་ལ་འཛུད་པའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔས་དེད་དཔོན་དུ་བྱའོ། །
en: “Bodhisattvas should be a merchant captain in order to enter the Great Vehicle.

source: བྱང་ཆུབ་ཏུ་དམ་བཅས་པ་ཉམས་འོག་ཏུ་ཆུད་པའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔས་ཁུར་རྩ་བ་ལྟ་བུར་བྱའོ། །
en: Bodhisattvas should be a porter in order to affirm their promise to awaken.

source: སེམས་ཅན་ཐམས་ཅད་བརྟེན་པའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔས་སྐྱེད་མོས་ཚལ་འདྲ་བར་བྱའོ། །
en: Bodhisattvas should be a pleasure garden in order to be a ground for all beings.

source: ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱི་ཟོང་ཡོངས་སུ་རྫོགས་པའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔས་གྲོང་ཁྱེར་ལྟ་བུར་བྱའོ། །
en: Bodhisattvas should be like a city in order to amass the ‘goods’ of omniscient wisdom.

source: སེམས་ཅན་ཐམས་ཅད་ལ་བུ་གཅིག་པ་བཞིན་དུ་བྱམས་པ་དང་ལྡན་པའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔས་ཕན་པ་འདོད་པར་བྱའོ། །
en: Bodhisattvas should wish to be beneficial in order to feel love for all beings as for an only child.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱིས་ཅི་བྱ་བ་ཡོངས་སུ་ཐོབ་པར་བྱ་བའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔས་བྲན་ལྟ་བུར་བྱའོ། །
en: Bodhisattvas should be like a servant to help all beings attain whatever they set out to do.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་རྨུ་རྒོད་དག་ལ་དྲང་བ་རྣམས་ཡིན་ནོ། །ཁེངས་པ་དག་ལ་ང་རྒྱལ་མེད་པ་རྣམས་ཡིན་ནོ། །གཡོ་ཅན་དག་ལ་གཡོ་མེད་པ་རྣམས་ཡིན་ནོ། །ཐིབས་པོ་སྤྱོད་པ་དག་ལ་སྒྱུ་མེད་པ་དང་ལྡན་པ་རྣམས་ཡིན་ནོ། །
en: “Furthermore, child of good family, bodhisattvas are principled with the unruly, humble with the arrogant, and resolute with the irresolute.

source: ལོག་པར་ཞུགས་པ་དག་ལ་སྙིང་རྗེ་དང་ལྡན་པ་རྣམས་ཡིན་ནོ། །ངོ་ཚ་མེད་པ་དག་ལ་ངོ་ཚ་དང་ལྡན་པ་རྣམས་ཡིན་ནོ། །
en: They are transparent with the impenetrable, compassionate with the misguided, modest with the immodest, and perfectly composed with the garrulous.

source: མུ་ཅོར་སྨྲ་བ་དག་ལ་ཁྲེལ་ཡོད་པ་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཡིན་ནོ། །ཕས་ཀྱི་རྒོལ་བ་ཐམས་ཅད་ལ་སེམས་སྤ་མ་གོང་བ་རྣམས་ཡིན་ནོ། །འཁོར་ཐམས་ཅད་ལ་བག་ཚ་བ་མེད་པ་རྣམས་ཡིན་ནོ། །འཇིག་རྟེན་གྱི་ཆོས་ཐམས་ཅད་ཀྱིས་མི་གོས་པ་རྣམས་ཡིན་ནོ། །
en: They are not timid before opponents, do not doubt their companions, and remain untainted by any worldly phenomena.

source: བདུད་ཐམས་ཅད་ཀྱིས་མི་འཕྲོག་པ་རྣམས་ཡིན་ནོ། །ཕས་ཀྱི་རྒོལ་བ་ཐམས་ཅད་ཀྱིས་མི་ཐུལ་བ་རྣམས་ཡིན་ནོ། །
en: They are unswayed by all māras and are undefeated by their opponents.

source: བླ་མ་དག་ལ་གུས་པ་དང་བཅས་པ་རྣམས་ཡིན་ནོ། །འཕགས་པ་དག་ལ་ཞེ་ས་དང་བཅས་པ་རྣམས་ཡིན་ནོ། །མང་དུ་ཐོས་པ་དག་ལ་རི་མོར་བྱེད་པ་རྣམས་ཡིན་ནོ། །
en: They have reverence for their masters, respect for noble beings, and venerate those who are deeply learned.

source: བསམ་གཏན་པ་དག་ལ་ངོ་མཚར་ཐོབ་པ་རྣམས་ཡིན་ནོ། །མཁས་པ་དག་ལ་ལྷག་པའི་བསམ་པ་འཇུག་པ་རྣམས་ཡིན་ནོ། །ཆོས་སྨྲ་བ་དག་ལ་སངས་རྒྱས་ཙམ་དུ་ཕངས་པར་སེམས་པ་དང་ལྡན་པ་རྣམས་ཡིན་ནོ། །བྱང་ཆུབ་སེམས་དཔའ་དག་ལ་སྐྱབས་སུ་སོང་བ་རྣམས་ཡིན་ནོ། །སངས་རྒྱས་དག་ལ་བསམ་པ་ཐམས་ཅད་ཀྱིས་ཞུགས་པ་རྣམས་ཡིན་ནོ། །
en: They are in awe of meditators, think highly of the wise, believe Dharma reciters to be buddhas themselves, take refuge in bodhisattvas, and devote their every thought to the buddhas.

source: ནན་ཏན་དག་ལ་སྙིང་པོར་འདུ་ཤེས་པ་རྣམས་ཡིན་ནོ། །ཉོན་མོངས་པ་ཐམས་ཅད་ཀྱིས་མི་འཇིགས་པ་རྣམས་ཡིན་ནོ། །
en: They recognize the importance of persistence and are unafraid of the afflictive emotions.

source: སྙིང་རྗེ་ཆེན་པོ་ལ་ཕྱོགས་པས་མྱ་ངན་ལས་འདས་པ་ལ་མི་ལྟ་བ་རྣམས་ཡིན་ནོ། །སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་ལ་མངོན་པར་དགའ་བས་འཁོར་བ་ལ་ཕྱོགས་པ་རྣམས་ཡིན་ནོ། །
en: They have no regard for nirvāṇa because they privilege great compassion, and they privilege saṃsāra because they take delight in ripening all beings.

source: རྙེད་པ་དང་བཀུར་སྟི་ཐམས་ཅད་ལ་མི་ལྟ་བས་ཟང་ཟིང་མེད་པར་ཆོས་སྟོན་པ་རྣམས་ཡིན་ནོ། །
en: They teach the Dharma free of materialistic concerns because they are unconcerned with gain and respect.

source: མི་རྟག་པ་དང་སྡུག་བསྔལ་བ་དང་བདག་མེད་པ་དང་མི་གཙང་བ་ཡོངས་སུ་ཤེས་པས་སེམས་ཕྱིན་ཅི་མ་ལོག་པ་རྣམས་ཡིན་ནོ། །
en: Their minds are unerring because they are well versed in the doctrines of impermanence, suffering, selflessness, and uncleanliness.

source: ཡུལ་ཐམས་ཅད་ལ་མི་ལྟ་བས་སེམས་རྣམ་པར་གྲོལ་བ་རྣམས་ཡིན་ནོ། །
en: Their minds are liberated because they are unconcerned with all objects.

source: འཕགས་པའི་རིགས་སུ་སྐྱེས་པས་རིགས་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཡིན་ནོ། །རབ་ཏུ་བྱུང་བ་མང་བས་བློ་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཡིན་ནོ། །
en: They are of excellent family because they were born into the noble family, and they have excellent intellects because of their strong renunciation.

source: སྡུག་བསྔལ་དང་ཀུན་འབྱུང་བ་དང་འགོག་པ་དང་། ལམ་ཤེས་པས་འཕགས་པ་རྣམས་ཡིན་ནོ། །
en: They are noble because they understand the truths of suffering, origin, cessation, and the path.

source: ཚུལ་ཁྲིམས་དང་། ཐོས་པ་དང་། བག་ཡོད་པ་ལ་གནས་པས་སྐྱེས་བུ་དམ་པ་རྣམས་ཡིན་ནོ། །
en: Because they maintain their discipline, studies, and vigilance, they are sublime beings.

source: འདུ་བྱེད་བདག་མེད་པར་ཡོངས་སུ་ཤེས་པ་དང་ལྡན་པས་སེམས་ཅན་ཐམས་ཅད་ལ་སེམས་མཉམ་པ་རྣམས་ཡིན་ནོ། །
en: They regard all beings equally because they understand the selflessness of compounded things.

source: འཕགས་པའི་ཕྱག་རྒྱས་བཏབ་པས་ལོག་པར་མི་ལྟུང་བའི་ཆོས་ཅན་རྣམས་ཡིན་ནོ། །
en: They have a character that will not regress because they are sealed with the seal of the noble ones.

source: ཕྱིར་མི་ལྡོག་པའི་ཕྱག་རྒྱས་བཏབ་པས་བྱང་ཆུབ་ཀྱི་སྙིང་པོར་གཞོལ་བ་རྣམས་ཡིན་ནོ། །
en: They are inclined toward the seat of awakening because they are sealed by the seal of irreversibility.

source: སྤྱོད་ལམ་མཛེས་པ་ཕུན་སུམ་ཚོགས་པས་བྱང་ཆུབ་སེམས་དཔའ་རྟག་ཏུ་གཙང་མ་ཡང་དག་པར་སྤྱོད་པ་རྣམས་ཡིན་ནོ། །
en: “Bodhisattvas’ behavior is always impeccable because they have excellent and admirable conduct.

source: འཇིག་རྟེན་གྱི་གསང་ཚིག་ལ་མངོན་པར་དགའ་བ་མ་ཡིན་ནོ། །སྡིག་པའི་གྲོགས་པོ་ལ་མངོན་པར་དགའ་བ་མ་ཡིན་ནོ། །རྙེད་པ་དང་། བཀུར་སྟི་དང་། ཚིགས་སུ་བཅད་པ་ལ་མངོན་པར་དགའ་བ་མ་ཡིན་ནོ། །
en: They take no delight in worldly intrigues, ill-intentioned companions, gain, respect, or fame.

source: འདུ་འཛི་དག་ལ་ཆགས་པ་མ་ཡིན་ནོ། །ཡུལ་རྒྱུས་ཀྱི་གཏམ་དང་། རྒྱལ་པོའི་གཏམ་དང་། ཆོམ་རྐུན་གྱི་གཏམ་དང་། བུད་མེད་ཀྱི་གཏམ་དང་།
en: They have no attraction to entertainments, folk tales, or tales of kings, thieves, or women.

source: བཞད་གད་ཀྱི་གཏམ་དང་། དམག་གི་གཏམ་དང་། འཐབ་ཅིང་རྩོད་པའི་གཏམ་ལ་ཆགས་པ་མ་ཡིན་ནོ། །ཡུལ་ངན་པ་དང་། ལྗོངས་ངན་པ་དང་།
en: They are not attracted to comedies, war stories, or tales about conflict.

source: ཡུལ་འཁོར་ངན་པ་དང་། གྲོང་དང་། གྲོང་ཁྱེར་དང་། ཚོང་འདུས་དང་། རི་བྲགས་ངན་པ་རྣམས་ལ་ཆགས་པ་མ་ཡིན་ནོ། །
en: They have no attraction to corrupt regions, districts, or kingdoms, nor are they attracted to corrupt towns, cities, market towns, or mountainous regions.

source: གར་དང་། བྲོ་དང་། བཞད་གད་དང་། གླུ་ལ་ཆགས་པ་མ་ཡིན་ནོ། །
en: They are also not attracted to dancing, acting, laughing, or singing.

source: གཞན་ཡང་རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་སེམས་ཅན་སེར་སྣ་ཅན་རྣམས་ལ་ཆགས་པ་མ་ཡིན་ནོ། །
en: “Furthermore, child of good family, bodhisattvas are not attracted to stingy people.

source: ཚུལ་ཁྲིམས་འཆལ་པ་རྣམས་དང་། མཚམས་སོ་སོར་བཅད་པ་རྣམས་དང་། རྒྱུན་སྨན་དུ་གྱུར་པ་རྣམས་ལ་ཆགས་པ་མ་ཡིན་ནོ། །
en: They are not attracted to people with poor discipline, who transgress limits, and who are constantly medicated.

source: གནོད་སེམས་ཀྱི་ཐ་བ་དང་། ཞེ་སྡང་མང་བ་རྣམས་ལ་ཆགས་པ་མ་ཡིན་ནོ། །
en: They are not attracted to those who are malicious, or to those with a lot of anger.

source: ལེ་ལོ་ཅན་རྣམས་དང་། བརྩོན་འགྲུས་ཆུང་ཞིང་བརྩོན་འགྲུས་བཏང་བ་རྣམས་ལ་ཆགས་པ་མ་ཡིན་ནོ། །
en: They are not attracted to people who are lazy, who have little diligence, or who have given up being diligent.

source: གཡེང་ཞིང་ཕྱིན་ཅི་ལོག་ཏུ་གྱུར་ལ་རྣམ་པར་འཕྲོ་བའི་སེམས་ལ་ཆགས་པ་མ་ཡིན་ནོ། །
en: They are not attracted to people whose minds are scattered with distraction and error.

source: ཤེས་རབ་འཆལ་པ་རྣམས་དང་། བླུན་པ་ལྐུགས་པའི་རང་བཞིན་ཅན་རྣམས་ལ་ཆགས་པ་མ་ཡིན་ནོ། །
en: They are not attracted to people with distorted insight, or to those who are naturally foolish and dumb.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་ཆོས་དང་། ཟང་ཟིང་དང་། མི་འཇིགས་པ་རབ་ཏུ་སྦྱིན་པ་ལ་མངོན་པར་དགའ་བ་ཡིན་ནོ། །
en: “Bodhisattvas delight in giving the Dharma, material goods, and fearlessness.

source: འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་ཡང་དག་པར་ཆད་པའོ། །
en: They eliminate desire, anger, and dullness.

source: རྣལ་འབྱོར་ཆེན་པོའི་རྣལ་འབྱོར་པ། སྒྲ་བསྙུངས་པ་ལ་དགའ་བའོ། །ཚིག་མི་མང་ཞིང་དུལ་བའོ། །ཞི་ཞིང་ཉེ་བར་ཞི་བ་ལ་དབེན་པ་དང་། ནགས་ཚལ་ཐིབས་པོ་དང་། རྩྭ་དང་། ཤིང་དང་། ལྡམ་ལྡུམ་ཡོད་པ་དང་།
en: They are yogins of the great yoga, take joy in being quiet, and are taciturn and restrained.

source: ས་ཁྱོན་ཆུང་ངུ་དང་། ཆུ་ངོགས་དང་། རི་ཁྲོད་དང་། ཕུག་སྣ་ཚོགས་དང་། རི་དང་། རྡོ་དང་།
en: They remain alone in peace and tranquility, delighting in the deep wilderness, grasslands, forests, farmland, small plots of land, riverbanks, mountains, caves, hills, rocky places, peaks, and open spaces.

source: རྩེ་མོ་དང་། གཡེའི་ཕྱོགས་རྣམས་ལ་མངོན་པར་དགའ་བ་ཡིན་ནོ། །ཞི་བ་དང་། རབ་ཏུ་ཞི་བ་དང་། ཉེ་བར་ཞི་བའི་ཕྱོགས་དེ་དག་ལ་རབ་ཏུ་དགའ་བ་ཡིན་ཏེ།
en: They find joy in places that are peaceful, calm, and tranquil.

source: གནས་བཅས་པའི་ཕྱོགས་དེ་དང་དེ་དག་ཏུ་ནམ་གྱི་ཆ་སྟོད་དང་། ནམ་གྱི་ཆ་སྨད་ལ་མི་ཉལ་བར་རྣལ་འབྱོར་ལ་བརྩོན་པར་གནས་པ་དང་། ཐོས་པ་དང་། སེམས་པ་དང་།
en: They reside in these kinds of places, exerting themselves in practice day and night without sleeping.

source: སྒོམ་པ་སྟུག་པོའི་མཐོང་ན་གནས་པ་དང་། བསམ་གཏན་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་དང་། དབང་དང་། བཟོད་པའི་སྒོ་བརྒྱ་སྟོང་ལ་རྣམ་པར་རྒྱུ་བ་དང་།
en: They reside where they see intense study, reflection, and meditation taking place.

source: ཆོས་ཀྱི་སྒོ་བརྒྱ་སྟོང་དཔག་ཏུ་མེད་པ་དག་རབ་ཏུ་རྣམ་པར་འབྱེད་པ་དང་། སངས་རྒྱས་བརྒྱ་སྟོང་ཡང་མཐོང་བ་དང་། ཏིང་ངེ་འཛིན་གྱི་སྒོ་བརྒྱ་སྟོང་ཡང་ཐོབ་པ་དང་། གཟུངས་ཀྱི་སྒོ་བརྒྱ་སྟོང་ཡང་མངོན་དུ་བྱེད་པ་དང་། སེམས་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཡང་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་དེ་ལྟ་བུ་དེ་དག་ལ་མངོན་པར་དགའ་བ་ཡིན་ཏེ།
en: They delight in places where a hundred thousand gateways of meditative concentration, samādhi, dhāraṇī, power, and acceptance are pursued, where the unfathomable hundred thousand Dharma gateways are investigated, where a hundred thousand buddhas are seen, where a hundred thousand gateways of samādhi are attained, where a hundred thousand gateways of dhāraṇī are actualized, and where hundreds of thousands of millions upon millions of beings are ripened.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔས་དེ་འདྲ་བར་བྱའོ། །
en: Child of good family, this is what bodhisattvas should do.

source: དེ་ལྟ་བུས་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཆོས་ཉིད་ཁོང་དུ་ཆུད་པར་ནུས་སོ། །
en: This is how they are able to understand the basic nature of the blessed buddhas.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྩོམ་པ་མེད་ཀྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཐེག་པ་ཆེན་པོ་ནི་བག་མཆིས་པར་གནས་ཤིང་སྒྲུབ་པ་ཉིད་སྙིང་པོར་བགྱིད་པ་རྣམས་ཀྱི་ལགས་སོ། །
en: The bodhisattva Nirārambha then said to the Blessed One, “Blessed One, the Great Vehicle takes vigilance and engaging in practice to be essential.
